app/Controllers/ArchivoController.php

    public function upload()
    {
        $archivos = $this->request->getFileMultiple('file');
        $destino = 'assets/uploads/';
        $res = 0;
        for ($i = 0; $i < count($archivos); $i++) {
            $archivo = $archivos[$i];
            $nombre = $archivo->getName();
            if ($archivo->move($destino, $nombre)) {
                $res = $this->archivoModel->insert(
                    [
                        'nombre' => $nombre,
                        'tipo' => $archivo->getClientMimeType(),
                        'tamano' => $archivo->getSize(),
                        'carpeta_id' => $this->request->getVar('carpeta_id'),
                        'user_id' => $this->session->user_id
                    ]
                );
---
INSERT INTO `archivos` (`nombre`, `tipo`, `tamano`, `carpeta_id`, `user_id`, `created_at`, `updated_at`) VALUES ('Fechas De Entrega.jpg', 'image/jpeg', 120357, '1', '1', '2024-09-01 19:45:11', '2024-09-01 19:45:11')

    public function show($id)
    {
        $data['archivos'] = $this->archivoModel
            ->where('carpeta_id', $id)
            ->orderBy('created_at', 'asc')
            ->findAll();
---
SELECT *
FROM `archivos`
WHERE `carpeta_id` = '1'
ORDER BY `created_at` ASC