app/Controllers/CarpetaController.php

    public function index()
    {
        $carpetas = $this->carpetaModel
            ->where([
                'user_id' => $this->session->user_id,
                'carpetapadre_id' => null
            ])->orderBy('carpeta_id', 'asc')
            ->paginate(12);

        $cantidadArchivos = $this->archivoModel->select('carpeta_id, COUNT(*) as total')
            ->where('user_id', $this->session->user_id)
            ->groupBy('carpeta_id')->get()->getResultArray();
---
SELECT *
FROM `carpetas`
WHERE `user_id` = '2'
AND `carpetapadre_id` IS NULL
ORDER BY `carpeta_id` ASC
 LIMIT 12
SELECT COUNT(*) AS `numrows`
FROM `carpetas`
WHERE `user_id` = '2'
AND `carpetapadre_id` IS NULL
SELECT `carpeta_id`, COUNT(*) as total
FROM `archivos`
WHERE `user_id` = '2'
GROUP BY `carpeta_id`

    public function show($id)
    {
        $carpetas = $this->carpetaModel
            ->where('carpetapadre_id', $id)->orderBy('carpeta_id', 'asc')
            ->paginate(12);

        $cantidadArchivos = $this->archivoModel->select('carpeta_id, COUNT(*) as total')
            ->where('user_id', $this->session->user_id)
            ->groupBy('carpeta_id')->get()->getResultArray();

        $archivosCount = [];
        foreach ($cantidadArchivos as $count) {
            $archivosCount[$count['carpeta_id']] = $count['total'];
        }

        foreach ($carpetas as &$carpeta) {
            $carpeta['total'] = $archivosCount[$carpeta['carpeta_id']] ?? 0;
        }

        $data = [
            'nuevo' => false,
            'regresar' => true,
            'carpeta' => $this->carpetaModel->find($id),
---
SELECT *
FROM `carpetas`
WHERE `carpetapadre_id` = '1'
ORDER BY `carpeta_id` ASC
 LIMIT 12
SELECT COUNT(*) AS `numrows`
FROM `carpetas`
WHERE `carpetapadre_id` = '1'
SELECT `carpeta_id`, COUNT(*) as total
FROM `archivos`
WHERE `user_id` = '2'
GROUP BY `carpeta_id`
SELECT *
FROM `carpetas`
WHERE `carpetas`.`carpeta_id` = '1'

    public function share($id)
    {
        $data['carpeta'] = $this->carpetaModel->find($id);
---
SELECT *
FROM `carpetas`
WHERE `carpetas`.`carpeta_id` = '1'

    public function usuarios($carpeta_id)
    {
        $compartida = new Carpcompartida();
        $id_usuario = $this->session->user_id;
        $data = $this->usuarioModel->where('user_id != ' . $id_usuario)->orderBy('created_at', 'desc')->findAll();
        //usuarios selecionados
        $seleccionados = $compartida->where('carpeta_id', $carpeta_id)->findColumn('user_id');
---
SELECT *
FROM `usuarios`
WHERE `user_id` != 2
ORDER BY `created_at` DESC
SELECT `user_id`
FROM `carpcompartidas`
WHERE `carpeta_id` = '1'

    public function compartir()
    {
        $valores = $this->request->getJSON(true);
        $compartida = new Carpcompartida();
        $data = 0;
        //ELIMINAR CARPETA COMPARTIDA ANTERIORES
        $compartida->where(['carpeta_id' => $valores['carpeta_id']])->delete();
        for ($i = 0; $i < count($valores['usuarios']); $i++) {
            $user = $valores['usuarios'][$i];
            $data = $compartida->insert([
                'user_id' => $user,
                'carpeta_id' => $valores['carpeta_id'],
                'usershare_id' => $this->session->user_id
            ]);
---
DELETE FROM `carpcompartidas`
WHERE `carpeta_id` = '1'
INSERT INTO `carpcompartidas` (`user_id`, `carpeta_id`, `usershare_id`, `created_at`, `updated_at`) VALUES ('3', '1', '2', '2024-08-30 14:10:56', '2024-08-30 14:10:56')