app/Controllers/LoginController.php

    public function validar()
    {
        $this->reglas = [
            'correo' => [
                'rules' => 'required|valid_email'
            ],
            'clave' => [
                'rules' => 'required'
            ]
        ];

        if ($this->request->is('post') && $this->validate($this->reglas)) {
            //REALIZAR CONSULTA A LA TABLA USUARIOS
            $data = $this->usuarios->where('correo', $this->request->getPost('correo'))->first();
---
SELECT *
FROM `usuarios`
WHERE `correo` = 'david@gmail.com'
 LIMIT 1